[  
  {
    "id": 1,
    "name": "Console PlayStation 5 - Mídia Física",
    "description": "O console PS5 oferece novas possibilidades de jogabilidade que você nunca imaginou. Reproduza jogos para PS5 e PS4 em Blu-ray Disc. Além disso, você também pode baixar jogos digitais para PS5 e PS4 pela PlayStation Store. Experimente o carregamento extremamente rápido do SSD de ultra-velocidade, uma imersão mais profunda com suporte à resposta tátil, gatilhos adaptáveis e áudio 3D. Além de uma geração totalmente nova de jogos incríveis PlayStation.",
    "category": "console",
    "price": 4499.00,
    "imageUrl": "https://i.pinimg.com/736x/76/47/bd/7647bd8094eafac2b391351f6799098e.jpg",
    "inStock": 50
  },
  {
    "id": 2,
    "name": "Console Playstation 5 - Edição Digital",
    "description": "O console PS5 oferece novas possibilidades de jogabilidade que você nunca imaginou. Reproduza jogos para PS5 e PS4 em Blu-ray Disc. Além disso, você também pode baixar jogos digitais para PS5 e PS4 pela PlayStation Store. Experimente o carregamento extremamente rápido do SSD de ultra-velocidade, uma imersão mais profunda com suporte à resposta tátil, gatilhos adaptáveis e áudio 3D. Além de uma geração totalmente nova de jogos incríveis PlayStation.",
    "category": "console",
    "price": 3999.00,
    "imageUrl": "https://i.pinimg.com/736x/3c/87/67/3c87673cf3c96de53e32e408aebcc3e0.jpg",
    "inStock": 50
  },
  {
    "id": 3,
    "name": "Console Microsoft Xbox Series S",
    "description": "Uso exclusivo para jogos digitais; o console não reproduz discos físicos 8K: Requer conteúdo e tela compatíveis 120 FPS: Requer conteúdo e tela compatíveis Desempenho e velocidade de última geração em um formato compacto e totalmente digital. Reprodução de streaming em 4K e Upscaling 4K para jogos Alterne entre os jogos com facilidade, retome com rapidez entre vários títulos e volte diretamente de onde parou Dolby: Dolby Vision HDR no Xbox requer uma tela compatível",
    "category": "console",
    "price": 3599.00,
    "imageUrl": "https://i.pinimg.com/736x/40/e1/61/40e1612f155885fbaf7e5220e694512a.jpg",
    "inStock": 50
  },
  {
    "id": 4,
    "name": "Console Microsoft Xbox Series X",
    "description": "Console Xbox mais rápido e poderoso de todos os tempos! Jogue milhares de títulos: todos os jogos têm melhor aparência e são melhor executados no Xbox Series X. No coração do Series X está a Xbox Velocity Architecture, que combina um SSD personalizado e software integrado para diminuir significativamente os tempos de carregamento dentro e fora do jogo.",
    "category": "console",
    "price": 4499.00,
    "imageUrl": "https://i.pinimg.com/736x/7b/f1/c5/7bf1c56e0843ba95f9e9976d08b5a711.jpg",
    "inStock": 50
  },
  {
    "id": 5,
    "name": "Volante Thrustmaster T-GT II - PS4/PS5/PC",
    "description": "Graças a mais de 23.000 horas de pesquisa e desenvolvimento intensivos, o Volante Thrustmaster T-GT II foi projetado para levar o incrível desempenho de realimentação de força de seu antecessor (T-GT) a novos patamares. Com o T-GT II, ??os jogadores do PlayStation 5, PlayStation 4 e PC podem desfrutar de um nível totalmente novo de precisão e durabilidade. O volante T-GT II está oficialmente licenciado para PlayStation 5 e Gran Turismo com T-LIN, T-DCC e especialmente T-DFB (3D Perceptual Feedback Effect).",
    "price": 5999.00,
    "imageUrl": "https://i.pinimg.com/564x/32/19/30/321930c5085f047179bf73ac63aa50f3.jpg",
    "inStock": 50
  },
  {
    "id": 6,
    "name": "Volante Thrustmaster T300RS GT - PS4/PS5/PC",
    "description": "O volante Force Feedback Thrustmaster T300RS GT permite aos jogadores mergulharem verdadeiramente no mundo das corridas de automóveis e aperfeiçoarem as suas técnicas para melhorarem o seu desempenho. Efeitos de força ultrarresponsivos e realistas, sem latência. As equipes de desenvolvimento da Thrustmaster adicionaram precisão às incríveis capacidades do motor. Fizeram isso incorporando a tecnologia H.E.A.R.T HallEffect AccuRate Technology®, que possui um sensor magnético sem contato: isso fornece uma resolução de 16 bits, resultando em 65.536 valores para a rotação do volante.",
    "price": 2999.00,
    "imageUrl": "https://i.pinimg.com/736x/74/40/15/7440152fa0948318ffff044e3189b0ac.jpg",
    "inStock": 50
  },
  {
    "id": 7,
    "name": "Pedais Thrustmaster T-LCM com célula de carga",
    "description": "O sistema H.E.A.R.T (HallEffect AccuRate Technology); Tecnologia sem contactos sem quaisquer potenciómetros; Assegura uma vida útil ilimitada e uma precisão ótima nas sessões de corridas de automóveis: resolução máxima de 16 bits, representando 65.536 valores por pedal; O conjunto de 6 molas incluído permite uma grande variedade de ajustes rápidos, para que possa personalizar as sensações no pedal do freio ao seu gosto; Ajuste a força de pressão para se adaptar na perfeição à sua configuração de corridas de automóveis (secretária ou mesa, “Wheel Stand Pro”, cockpit GT, cockpit F1, etc.).",
    "price": 1899.00,
    "imageUrl": "https://i.pinimg.com/736x/fd/d1/fd/fdd1fd168421c10717dba52279b0fd49.jpg",
    "inStock": 50
  },
  {
    "id": 8,
    "name": "Aro Thrustmaster Ferrari SF-1000",
    "description": "Thrustmaster formula wheel add-on ferrari sf1000 edition, replica wheel, pc, ps4, ps5, xbox one e series xs, display e painel led, painel frontal 100% fibra de carbono, licenciado pela ferrari - A mais recente criação resultante da colaboração de décadas entre o thrustmaster e a ferrari, este produto é uma réplica em escala 1:1 do volante do lendário carro de corrida monolugar ferrari sf1000.",
    "price": 3999.00,
    "imageUrl": "https://i.pinimg.com/736x/a2/3e/6b/a23e6b8f164371e20af5161d263d6db6.jpg",
    "inStock": 50
  },
  {
    "id": 9,
    "name": "Volante Logitech G29 - PS4/PS5/PC",
    "description": "Você nunca mais vai querer correr com um controle normal após experimentar o Driving Force. O volante G29 foi cuidadosamente projetado para os mais recentes jogos de corrida dos consoles PlayStation 3 e PlayStation 4 e PlayStation 5. O Driving Force G29 funciona também com o seu PC, através do software Logitech Gaming. Com D-Pad, botões e câmbios incorporados ao volante G29, os controles estão sempre ao seu alcance. Possui também luzes LED indicadoras, localizadas logo acima do centro do volante, fornecendo aviso exato de quando aumentar ou diminuir a marcha.",
    "price": 1799.00,
    "imageUrl": "https://i.pinimg.com/736x/41/32/ec/4132ec5469fe7a05e5f9565e8ab50666.jpg",
    "inStock": 50
  },
  {
    "id": 10,
    "name": "Volante Logitech G923 - Xbox one/Series/PC",
    "description": "Sinta os pistões bombeando, o cascalho sendo esmagado e cada mudança de marcha, derrapadas e curvas fechadas como nunca antes. Um pedal de freio progressivo recria um sistema de freio sensível à pressão, enquanto uma embreagem dupla programável simula uma assistência real à arrancada de carros de corrida em jogos suportados. O design simplificado apresenta controles integrados ao volante para melhor desempenho, com um seletor de 24 pontos, incluindo controles completos de console e o clássico display de RPM em LED para jogos compatíveis.",
    "price": 2499.00,
    "imageUrl": "https://i.pinimg.com/736x/a8/09/6d/a8096dbeebf5af77dc6474e56e745924.jpg",
    "inStock": 50
  },
  {
    "id": 11,
    "name": "Headset HyperX Cloud Alpha S",
    "description": "O HyperX Cloud Alpha S baseia-se no inovador Cloud Alpha e possui o som 7.1 surround virtual customizado pela HyperX. Com a placa de controle de áudio incluída você pode ativar o som surround, ajustar o áudio do jogo e o equilíbrio do bate-papo sem precisar entrar em nenhum menu. Os controles deslizantes de graves foram adicionados aos fones de ouvido para que você possa personalizar ainda mais o seu áudio. O Cloud Alpha S ainda possui o sistema de drivers de câmara dupla que reduz a distorção e proporciona um som mais claro e também conta com o conforto de assinatura HyperX proporcionado pelas almofadas auriculares com espuma de memória, que foram aprimoradas com material sintético extra respirável.",
    "price": 499.00,
    "imageUrl": "https://i.pinimg.com/564x/a8/49/35/a84935f8d2df99fdf3c7392c7079aa7d.jpg",
    "inStock": 50
  },
  {
    "id": 12,
    "name": "Headset HyperX Cloud Flight",
    "description": "Ultrapasse os limites das conexões a cabo e navegue livremente com o HyperX Cloud Flight wireless. Com uma conexão sem fio sólida de nível gamer, incríveis 30 horas de duração da bateria e o conforto com a assinatura HyperX, o Cloud Flight te permite jogar ininterruptamente por mais tempo. Monitore com facilidade a vida da bateria e ajuste o microfone e o volume do som com o software HyperX NGenuity. O modelo do fone de ouvido fechado te mantém imerso no jogo, enquanto que o arco da cabeça com controle deslizante em aço e a estrutura de alta qualidade significam que ele foi criado para resistir aos desgastes diários.",
    "price": 759.99,
    "imageUrl": "https://i.pinimg.com/564x/8c/fc/9b/8cfc9bd6fe57ff4025d29a8c483bbda4.jpg",
    "inStock": 50
  },
  {
    "id": 13,
    "name": "Teclado mecânico HyperX Alloy FPS",
    "description": "O Teclado Mecânico Gamer HyperX Alloy é projetado para ser resistente e proporcionar uma experiência imersiva aos jogadores, na qual é possível desempenhar alta performance, precisão e jogabilidade de ações concretas e possíveis. Os destaques tecnológicos do Teclado Mecânico Gamer HyperX Alloy FPS são incríveis. As teclas RGB chamam a atenção e possuem diversos efeitos de iluminação. De forma dinâmica, os usuários podem configurar da forma que acharem melhor.",
    "price": 499.00,
    "imageUrl": "https://i.pinimg.com/564x/b7/39/8c/b7398c601d936b472616dd8c41c746fb.jpg",
    "inStock": 50
  },
  {
    "id": 14,
    "name": "Mouse gamer HyperX Pulsefire Surge",
    "description": "O mouse gamer HyperX Pulsefire Surge RGB maximiza estilo e conteúdo, oferecendo extrema precisão graças a seu sensor Pixart 3389 e efeitos de iluminação RGB espetaculares em 360° com seu exclusivo anel de luzes. As configurações DPI nativas do Pulsefire Surge podem chegar até 16.000 DPI para uma precisão espetacular e os switches Omron com capacidade para 50 milhões de cliques asseguram que seus toques serão registrados. Personalize a iluminação do seu Pulsefire Surge, DPI e funcionalidade do botão com o poderoso software Ngenuity.",
    "price": 349.00,
    "imageUrl": "https://i.pinimg.com/564x/96/44/25/9644259eb496d5af77e0109e8136d3e8.jpg",
    "inStock": 50
  },
  {
    "id": 15,
    "name": "Controle DualSense para PlayStation 5",
    "description": "Sinta o feedback fisicamente responsivo às suas ações no jogo com atuadores duplos que substituem os motores tradicionais. Em suas mãos, essas vibrações dinâmicas podem simular a sensação de tudo, desde ambientes até o recuo de diferentes armas. Experimente vários níveis de força e tensão conforme você interage com o equipamento e os ambientes do jogo. Desde puxar a corda do arco cada vez mais tensa até pisar no freio em um carro em alta velocidade, sinta-se fisicamente conectado às suas ações na tela.",
    "price": 359.00,
    "imageUrl": "https://i.pinimg.com/564x/58/69/92/5869929097cf73e66dc199f6ff9611bd.jpg",
    "inStock": 50
  },
  {
    "id": 16,
    "name": "Controle para Xbox Series S/X",
    "description": "Experimente o design modernizado do Novo Controle Sem Fio - Robot White, com superfícies esculpidas e geometria refinada para maior conforto durante o jogo. Fique no alvo com o grip texturizado e um direcional híbrido. Capture e compartilhe conteúdo perfeitamente com um botão Compartilhar dedicado. Conecte-se, jogue e alterne rapidamente entre dispositivos, incluindo Xbox Series X|S, Xbox One, PC com Windows 10, telefones e tablets compatíveis.",
    "price": 449.00,
    "imageUrl": "https://i.pinimg.com/564x/74/5d/c4/745dc40c8692f0fff8896f670e113a25.jpg",
    "inStock": 50
  },
  {
    "id": 17,
    "name": "Placa de vídeo Asus NVIDIA GeForce RTX 4070 Ti",
    "description": "A plataforma definitiva para jogadores e criadores com tecnologia GeForce RTX 40 Series NVIDIA Ada Lovelace Multiprocessadores de streaming com desempenho e eficiência energética, núcleos tensores de quarta geração, IA Núcleos RT de terceira geração com mais desempenho de Ray Tracing",
    "price": 6499.00,
    "imageUrl": "https://i.pinimg.com/564x/2e/b2/da/2eb2daccf52749dfded154c4bbea92c5.jpg",
    "inStock": 50
  },
  {
    "id": 18,
    "name": "Placa de Vídeo RTX 4090 Asus NVIDIA ROG Strix",
    "description": "Desempenho e eficiência de energia até 2x, Núcleos tensores de 4ª geração: desempenho de IA até 2X, Núcleos RT de 3ª Geração: Desempenho de rastreamento de raios até 2X, Ventiladores de tecnologia axial ampliados para 23% mais fluxo de ar. Com dissipador de calor fresado para temperaturas de GPU mais baixas. Design de 3,5 slots : matriz de aletas maciça otimizada para fluxo de ar das três ventoinhas Axial-tech. A cobertura, a estrutura e a placa traseira fundidas adicionam rigidez e são ventiladas para maximizar ainda mais o fluxo de ar e a dissipação de calor.",
    "price": 12999.00,
    "imageUrl": "https://i.pinimg.com/564x/12/ee/30/12ee303b4b1794aa55218410e146986f.jpg",
    "inStock": 50
  },
  {
    "id": 19,
    "name": "Processador Intel Core i9 13900k",
    "description": "Processador para desktop Intel Core i9-13900K da 13ª geração. Apresentando as tecnologias Intel Adaptive Boost, Intel Thermal Velocity Boost, Intel Turbo Boost Max Technology 3.0, e suporte PCIe 5.0 & 4.0, suporte DDR5 e DDR4, os processadores desbloqueados para desktop Intel Core i9 da 13ª Geração são otimizados para jogadores entusiastas e criadores profissionais e ajudam a oferecer alto desempenho. Compatível com as placas-mãe com base em chipset Intel Série 700 e Intel Série 600. Potência base do processador de 125W.",
    "price": 3984.99,
    "imageUrl": "https://i.pinimg.com/564x/92/07/12/92071283d4e5e842cdc33b64e3f7bdca.jpg",
    "inStock": 50
  },
  {
    "id": 20,
    "name": "Processador AMD Ryzen 9 7950x3D",
    "description": "O processador amd Ryzen 9 7950x3d para desktop aumenta o nível dos jogos e streaming, possui ótimo desempenho com 16 núcleos e 32 threads. Com a tecnologia amd 3d v-cache você alcança o melhor desempenho nos jogos, além da baixa latência. O Ryzen 9 7950x3d é ideal para você que é jogador e criador de conteúdo, eleve o padrão e mantenha tudo no controle sem preocupações. Amplie e acelere o armazenamento com o ryzen 9 7950x3d além de contar com clock boost máximo de 5.7ghz e clock básico de 4.2ghz. O processador AMD é compatível com as tecnologias amd expo e AMD Ryzen.",
    "price": 3824.99,
    "imageUrl": "https://i.pinimg.com/564x/31/fe/8f/31fe8ff5b5ce43ad7ea1b06aa8eb7aec.jpg",
    "inStock": 50
  },
  {
    "id": 21,
    "name": "Placa Mãe Asus Rog Crosshair X670e",
    "description": "Fornecimento de energia e gerenciamento térmico robusto formam os princípios para sua construção. Conectividade de hipervelocidade, suporte abrangente a PCIE 5.0 e DDR5 e iluminação Polymo adicionam camadas potentes de personalização de construção. E os toques finais são adicionados por utilitários exclusivos e controles de overclock que permitem que você flexione de forma exclusiva o desempenho dos processadores Ryzen 7000 Series. Defina sua construção AM5 com o ROG Crosshair X670E Hero.",
    "price": 5999.00,
    "imageUrl": "https://i.pinimg.com/564x/17/e7/83/17e78362ddec466da1003356a34778c1.jpg",
    "inStock": 50
  },
  {
    "id": 22,
    "name": "Placa Mãe Gigabyte Z790 Aourus Master",
    "description": "Com as rápidas mudanças tecnológicas, a GIGABYTE sempre segue as últimas tendências e oferece aos clientes recursos avançados e tecnologias mais recentes. As placas-mãe GIGABYTE são equipadas com soluções de energia atualizadas, padrões de armazenamento mais recentes e conectividade excepcional para permitir desempenho otimizado para jogos.",
    "price": 6999.00,
    "imageUrl": "https://i.pinimg.com/564x/88/a2/21/88a22193d07d44e1784c283bc951fef9.jpg",
    "inStock": 50
  }
]